Repository: JafarKMarouf/Mini-Social-Feed-Application
Catalog: lib/core/l10n/arb/intl_*.arb
Languages: ar

# languageCode
source: Arabic
ar: انكليزية

source: Change Language
ar: تغيير اللغة

# intro1
source: Dive into a paginated list of posts from everyone you follow and new profiles to discover. Infinite scrolling means the feed never endsâ€”stay updated, all day long.
ar: تصفح قائمة متجددة من منشورات متابعيك والملفات الشخصية الجديدة لاكتشافها. التمرير اللانهائي يعني أن الموجز لا ينتهي—ابقَ على اطلاع دائم طوال اليوم.

# intro2
source: Easily create new posts, update existing ones, and manage your content. Upload images and videos directly from your device using simple media attachments.
ar: قم بإنشاء منشورات جديدة وتحديث المنشورات الحالية وإدارة المحتوى الخاص بك بسهولة. حمّل الصور ومقاطع الفيديو مباشرة من جهازك باستخدام مرفقات الوسائط البسيطة.

# intro3
source: Your account is protected by token-based authentication. Our system handles secure login, logout, and automatic token refresh in the background, keeping your session seamless and secure.
ar: حسابك محمي بواسطة مصادقة قائمة على التوكن. يتعامل نظامنا مع تسجيل الدخول وتسجيل الخروج الآمن والتحديث التلقائي للتوكن في الخلفية، مما يحافظ على جلستك سلسة وآمنة.

# enterName
source: Enter your name
ar: أدخل اسمك

# enterEmail
source: Enter your email
ar: أدخل بريدك الإلكتروني

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Login
ar: تسجيل الدخول

source: Register
ar: تسجيل حساب جديد

# forgetPassword
source: Forgot password?
ar: نسيت كلمة المرور؟

# welcomeLogin
source: Welcome back! Glad to see you, Again!
ar: مرحبًا بعودتك! سعداء برؤيتك مجددًا!

# welcomeRegister
source: Hello! Register to get started
ar: مرحبًا! سجل لتبدأ

source: Loading...
ar: جار التحميل...

# nameRequired
source: This name is required
ar: الاسم مطلوب

# emailRequired
source: This email is required
ar: البريد الإلكتروني مطلوب

# passwordRequired
source: This password is required
ar: كلمة المرور مطلوبة

# nameMinLength
source: Must be at least 2 characters
ar: يجب أن يكون حرفين على الأقل

# valEmail
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح

# passwordLength
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل

# passwordContainUpperCharacter
source: Password must contain at least one uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل

# passwordContainLowerCharacter
source: Password must contain at least one lowercase letter
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل

# passwordContainNumber
source: Password must contain at least one number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل

# passwordContainSpecialCharacter
source: Password must contain at least one special character
ar: يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل

# connectionTimeout
source: Connection timeout with the server.
ar: انتهت مهلة الاتصال بالخادم.

# sendTimeout
source: Request timed out while sending data.
ar: انتهت مهلة الطلب أثناء إرسال البيانات.

# receiveTimeout
source: Response reception timed out from the server.
ar: انتهت مهلة استلام الرد من الخادم.

# badCertificate
source: Security certificate is invalid.
ar: شهادة الأمان غير صالحة.

# requestCancelled
source: The request was cancelled.
ar: تم إلغاء الطلب.

source: No internet connection.
ar: لا يوجد اتصال بالإنترنت.

# unknownError
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.

# badRequest
source: Bad request. Please check the data submitted.
ar: طلب غير صالح. يرجى التحقق من البيانات المرسلة.

# unauthorized
source: Unauthorized access.
ar: وصول غير مصرح به.

# forbidden
source: Forbidden access. You do not have permission.
ar: وصول مرفوض. ليس لديك الصلاحية.

# notFound
source: The page or service was not found.
ar: الصفحة أو الخدمة غير موجودة.

# requestTimeout
source: The request timed out.
ar: انتهت مهلة الطلب.

# conflict
source: Data conflict occurred.
ar: حدث تعارض في البيانات.

# unprocessableEntity
source: The submitted data is incorrect/invalid.
ar: البيانات المرسلة غير صحيحة/غير صالحة.

# tooManyRequests
source: Request limit exceeded. Please try again later.
ar: تم تجاوز حد الطلبات. يرجى المحاولة لاحقًا.

source: Internal server error.
ar: خطأ داخلي في الخادم.

# badGateway
source: Bad gateway error.
ar: خطأ في البوابة (Bad Gateway).

# serviceUnavailable
source: Service is currently unavailable.
ar: الخدمة غير متوفرة حاليًا.

source: Gateway timeout.
ar: انتهت مهلة البوابة.

# dataProcessingError
source: An error occurred while processing data from the server. Please try again later.
ar: حدث خطأ أثناء معالجة البيانات من الخادم. يرجى المحاولة لاحقًا.

# serverErrorWithCode
source: Server error ({statusCode}).
ar: خطأ في الخادم ({statusCode}).

# requestErrorWithCode
source: Request error ({statusCode}).
ar: خطأ في الطلب ({statusCode}).

# unknownErrorCode
source: Unknown error ({statusCode} or no code).
ar: خطأ غير معروف ({statusCode} أو بدون رمز).

# sessionExpired
source: Session validity has ended. You need to log in again.
ar: انتهت صلاحية الجلسة. تحتاج إلى تسجيل الدخول مرة أخرى.

source: My Ads Management
ar: إدارة إعلاناتي

source: Change Password
ar: تغيير كلمة المرور

source: About App
ar: عن التطبيق

source: Privacy Policy
ar: سياسة الخصوصية

source: Logout
ar: تسجيل الخروج

# logoutConfirmation
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء
